from attr import define, field

@define
class SignConfig():
    
    # 设置签署方的签署顺序
    #   - 按序签时支持传入顺序值 1 - 255（值小的先签署）
    #   - 同时签时，允许值重复
    signOrder : str = field(default='1')

    # 设置页面强制阅读倒计时时间，默认值为 0（单位：秒，最大值999）
    forcedReadingTime : int = field(default = 0)


# @define
# class NoticeConfig():
#     """
#     设置签署方的通知方式
#     """
#     # 通知类型，默认不通知（值为""空字符串），允许多种通知方式，请使用英文逗号分隔
#     # 传空 - 不通知（默认值）
#     # 1 - 短信通知（如果套餐内带“分项”字样，请确保开通【电子签名流量费（分项）认证】中的子项：【短信服务】，否则短信通知收不到）
#     # 2 - 邮件通知
#     # 补充说明：
#     # 个人账号中需要绑定短信/邮件才有对应的通知方式。
#     # 该通知是签署方维度的，只控制签署人的签署提醒短信，不控制流程的撤销、完成、抄送等短信通知。
#     noticeTypes : str